
#القليل من المرح: تشغيل خوارزمية رياضية-تاريخية بالبايثون
#برنامج لتحديد اليوم الموافق لأي تاريخ
#اعتمدت فيه على خوارزمية خاصة بالتقويم الميلادي
#من إنجاز "حوري مديحة" وقد تم نشره على مدونة "في ستة أيام
#الثغرة. تقع في شهري جانفي (11) وفيفري(12) فقط وقد تم معالجتها لكل التواريخ الممتدة بين القرنين 20 و21
#المبزة: بالنسبة للأشهر الأخرى (من مارس إلى ديسمبر) فالبرنامج صالح لكل التواريخ القديمة والحديثة على اختلافها

print('أهلا وسهلا بكم في برنامجنا لتحديد اليوم الموافق لأي تاريخ')
print('========================================')
print('اُكتب من فضلك رقم اليوم، مثلا 5 جويلية، 5 هو رقم اليوم')
d = int(input())
print('-----------------------------')
print('ترقيم الأشهر المٌعتمد هو الآتي')
print('********************************')
print('''1 – مارس (March)
2 – أفريل (April)
3 – ماي (May)
4 – جوان (June)
5 – جويلية (July)
6 – أوت (August)
7 – سبتمبر (September)
8 – أكتوبر (October)
9 – نوفمبر (November)
10 – ديسمبر (December)
11 – جانفي (January)
12 – فيفري (February)''')
print('********************************')
print('اُكتب رقم الشهر، بالاستعانة بالترقيم المٌعتمد أعلاه، من فضلك')
m = int(input())
print('-----------------------------')
print('اُكتب رقم السنة الموافقة، من فضلك')
y = int(input())

cc = int(y / 100)
dd = int(y % 100)

a = ((d + int(2.6 * m - 0.2) - 2 * cc + dd + int(dd / 4) + int(cc / 4)) + 7) % 7

print('==========')

if a == 0:
    print('الأحد')
elif a == 1:
    print('الإثنين')
elif a == 2:
    print('الثلاثاء')
elif a == 3:
    print('الأريعاء')
elif a == 4:
    print('الخميس')
elif a == 5:
    print('الجمعة')
elif a == 6:
    print('السبت')

# ======================================================

if (cc == 19) and (m == 11 or m == 12) and a == 0:
    print('عذرا، بل السبت')
elif (cc == 19) and (m == 11 or m == 12) and a == 1:
    print('عذرا، بل الأحد')
elif (cc == 19) and (m == 11 or m == 12) and a == 2:
    print('عذرا، بل الإثنين')
elif (cc == 19) and (m == 11 or m == 12) and a == 3:
    print('عذرا، بل الثلاثاء')
elif (cc == 19) and (m == 11 or m == 12) and a == 4:
    print('عذرا، بل الأربعاء')
elif (cc == 19) and (m == 11 or m == 12) and a == 5:
    print('عذرا، بل الخميس')
elif (cc == 19) and (m == 11 or m == 12) and a == 6:
    print('عذرا، بل الجمعة')

# ======================================================

if (cc == 20) and (m == 11 or m == 12) and a == 0:
    print('عذرا، بل الجمعة')
elif (cc == 20) and (m == 11 or m == 12) and a == 1:
    print('عذرا، بل السبت')
elif (cc == 20) and (m == 11 or m == 12) and a == 2:
    print('عذرا، بل الأحد')
elif (cc == 20) and (m == 11 or m == 12) and a == 3:
    print('عذرا، بل الإثنين')
elif (cc == 20) and (m == 11 or m == 12) and a == 4:
    print('عذرا، بل الثلاثاء')
elif (cc == 20) and (m == 11 or m == 12) and a == 5:
    print('عذرا، بل الأربعاء')
elif (cc == 20) and (m == 11 or m == 12) and a == 6:
    print('عذرا، بل الخميس')

# ======================================================

if (cc == 20) and (dd != 20) and (m == 11 or m == 12) and a == 0:
    print('بل هو السبت')
elif (cc == 20) and (dd != 20) and (m == 11 or m == 12) and a == 1:
    print('بل هو الأحد')
elif (cc == 20) and (dd != 20) and (m == 11 or m == 12) and a == 2:
    print('بل هو الإثنين')
elif (cc == 20) and (dd != 20) and (m == 11 or m == 12) and a == 3:
    print('بل هو الثلاثاء')
elif (cc == 20) and (dd != 20) and (m == 11 or m == 12) and a == 4:
    print('بل هو الأربعاء')
elif (cc == 20) and (dd != 20) and (m == 11 or m == 12) and a == 5:
    print('بل هو الخميس')
elif (cc == 20) and (dd != 20) and (m == 11 or m == 12) and a == 6:
    print('بل هو الجمعة')

print('==========')
